02-values-types-variables.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-21 Sun 09:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Values, Types, and Variables</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="highlight/styles/vs2015.css">
</head>
<body>
<div id="content">
<h1 class="title">Values, Types, and Variables</h1>
<p>
<b><a href="index.html">Home</a></b>
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8e40b5a">1. Values, Types, and Variables</a>
<ul>
<li><a href="#org39c6efe">1.1. Introduction</a></li>
<li><a href="#org63dee53">1.2. Values and Types</a></li>
<li><a href="#orgec4bad5">1.3. Variables</a></li>
<li><a href="#orgc680e6a">1.4. Example REPL session</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org8e40b5a" class="outline-2">
<h2 id="org8e40b5a"><span class="section-number-2">1</span> Values, Types, and Variables</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org39c6efe" class="outline-3">
<h3 id="org39c6efe"><span class="section-number-3">1.1</span> Introduction</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Programming, by and large, is a matter of computing information. While that may sound dull at first, keep in mind that it is up to you, the programmer, to decide what information to deal with and what the outcomes are. For instance, the information could be keys actively being pressed on a keyboard to control a game and the outcome be the visible game itself. Or the information could be user profiles and uploaded images, with the outcome being a social media website (like Instagram). As you can see, when we talk about information we are talking in vague and abstract terms, but we all have an intuition for what information means. In programming, we turn this vague notion into concrete things so the computer can understand them.
</p>
</div>
</div>

<div id="outline-container-org63dee53" class="outline-3">
<h3 id="org63dee53"><span class="section-number-3">1.2</span> Values and Types</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<b>Values</b> represent pieces of information, which is as abstract as it sounds. You get to decide what a piece of information is, as information can be broken down and put together in various ways. It is important to think of each value as belonging to a certain <b>type</b>. In other words, a value does not exist on its own without a type.
</p>

<p>
Here is a list of the types that will be used throughout these lessons:
</p>
<ul class="org-ul">
<li>undefined</li>
<li>null</li>
<li>number</li>
<li>boolean</li>
<li>function</li>
<li>string</li>
<li>array</li>
<li>object</li>
</ul>

<blockquote>
<p>
Note: The list of types above differs from the technical list of types in JavaScript. The above types are the intuitive types, meaning it's closer to what goes on in our head when programming with JavaScript. For the technical types in JavaScript, see <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Data_structures">MDN</a>.
</p>
</blockquote>

<p>
Although values can represent any piece of information, in JavaScript there are rules for how we can write values. In general, the ways that we can properly write JavaScript are referred to as <b>syntax</b> rules. Writing something that isn't understood by the JavaScript interpreter is called a syntax error and will cause the interpreter to show the error.
</p>

<p>
Let's look at a brief meaning of each type and some possible values.
</p>
</div>

<div id="outline-container-org8a08d92" class="outline-4">
<h4 id="org8a08d92"><span class="section-number-4">1.2.1</span> undefined</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
<b>undefined</b> exists sort of as a catch-all for when no other value and type fits the situation. Most commonly, it is the value and type given to a variable that hasn't explicitly been given any other value, or a function that doesn't return any other value.
</p>

<p>
There is only one possible value of the undefined type, of the same name: <code>undefined</code>.
</p>
</div>
</div>

<div id="outline-container-org1301aa9" class="outline-4">
<h4 id="org1301aa9"><span class="section-number-4">1.2.2</span> null</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
<b>null</b> is similar to undefined. It is commonly used in the scenario where a value is expected to be an object that may not exist. If the object doesn't exist, null is used. It is preferred to use null when setting a value to mean "this doesn't exist" instead of undefined because undefined gets used by the JavaScript interpreter automatically.
</p>

<p>
There is only one possible value of the null type, of the same name: <code>null</code>.
</p>
</div>
</div>

<div id="outline-container-org9db8cd0" class="outline-4">
<h4 id="org9db8cd0"><span class="section-number-4">1.2.3</span> number</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
The <b>number</b> type is self-explanatory. Anytime we want to represent a number of any sort, we would want to use the number type.
</p>

<p>
Possible values:
</p>
<ul class="org-ul">
<li><code>0</code></li>
<li><code>1</code></li>
<li><code>-1234</code></li>
<li><code>0.65</code></li>
<li>(virtually any number)</li>
</ul>
</div>
</div>

<div id="outline-container-org96578c7" class="outline-4">
<h4 id="org96578c7"><span class="section-number-4">1.2.4</span> boolean</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
The <b>boolean</b> type is for representing something that can only be one of two values:
</p>
<ul class="org-ul">
<li><code>true</code></li>
<li><code>false</code></li>
</ul>
</div>
</div>

<div id="outline-container-org033b94a" class="outline-4">
<h4 id="org033b94a"><span class="section-number-4">1.2.5</span> function</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
The <b>function</b> type is for representing a sort of operation that can be applied to values to produce another value.
</p>

<p>
A function may look something like this: <code>(x) =&gt; x + 1</code>.
</p>

<p>
Functions will be covered later in depth.
</p>
</div>
</div>

<div id="outline-container-org496f66b" class="outline-4">
<h4 id="org496f66b"><span class="section-number-4">1.2.6</span> string</h4>
<div class="outline-text-4" id="text-1-2-6">
<p>
The <b>string</b> type is for representing words and general text.
</p>

<p>
Possible values:
</p>
<ul class="org-ul">
<li><code>'a'</code></li>
<li><code>'1'</code></li>
<li><code>'Hello, world!'</code></li>
<li>(virtually anything surrounded by quotes)</li>
</ul>

<p>
Strings will be covered later in depth.
</p>
</div>
</div>

<div id="outline-container-org93523d5" class="outline-4">
<h4 id="org93523d5"><span class="section-number-4">1.2.7</span> array</h4>
<div class="outline-text-4" id="text-1-2-7">
<p>
The <b>array</b> type is for holding a list of values. The values inside of an array can be any type (including arrays themselves).
</p>

<p>
Arrays look something like this:
</p>
<ul class="org-ul">
<li><code>[1, 2, 3]</code></li>
<li><code>['apple', 'banana', 'cherry']</code></li>
<li><code>[]</code></li>
<li><code>[false]</code></li>
<li>(virtually anything in square brackets separated by commas)</li>
</ul>

<p>
Arrays will be covered later in depth.
</p>
</div>
</div>

<div id="outline-container-org1a5c94d" class="outline-4">
<h4 id="org1a5c94d"><span class="section-number-4">1.2.8</span> object</h4>
<div class="outline-text-4" id="text-1-2-8">
<p>
The <b>object</b> type is for representing a more complex structure that doesn't fit into any of the other types. Defining an object of a particular structure can be thought of as defining a new type.
</p>

<p>
Objects look something like this:
</p>
<ul class="org-ul">
<li><code>{a: 1, b: 2}</code></li>
<li><code>{name: 'Alice', age: 30}</code></li>
<li><code>{}</code></li>
</ul>

<p>
Objects will be covered later in depth.
</p>
</div>
</div>
</div>

<div id="outline-container-orgec4bad5" class="outline-3">
<h3 id="orgec4bad5"><span class="section-number-3">1.3</span> Variables</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<b>Variables</b> let us assign a name to a value and reuse it wherever we want.
</p>

<p>
In functional JavaScript, variables are always declared with <code>const</code>. You may see <code>var</code> or <code>let</code> used in other JavaScript code, but not in these lessons. This is great because there's less to think about when declaring a variable and there are stricter rules about how variables work.
</p>

<p>
The syntax to define a variable looks like this:
</p>

<div class="org-src-container">
<pre class="src src-js">const favNumber = 10;
</pre>
</div>

<p>
The line must start with the word "const", followed by the name of the variable, the equals sign, and finally the desired value. It is conventional to end JavaScript statements like this with a semicolon. In this example, we are defining a variable named "favNumber" and assigning it the number 10 as its value. This variable will always be 10. The equals sign works the same as in math; the left side equals the right side. Wherever else in the code we use "favNumber", we can substitute 10, and vice versa.
</p>

<p>
Variable names are conventionally written in <a href="https://en.wikipedia.org/wiki/Camel_case">camelCase</a>. It is encouraged to give variables meaningful names, as we will do throughout the lessons.
</p>

<p>
Defining a variable is a kind of <b>statement</b>, which is an expression that JavaScript understands as a single instruction. Writing JavaScript code is simply writing a series of statements. The JavaScript interpreter reads these statements left-to-right, top-to-bottom, just like we read plain English. A variable cannot be used before it is defined.
</p>
</div>
</div>

<div id="outline-container-orgc680e6a" class="outline-3">
<h3 id="orgc680e6a"><span class="section-number-3">1.4</span> Example REPL session</h3>
<div class="outline-text-3" id="text-1-4">
<pre class="example">
C:\Users\Tim&gt;node
Welcome to Node.js v12.16.1.
Type ".help" for more information.
&gt; undefined
undefined
&gt; null
null
&gt; 1
1
&gt; true
true
&gt; (x) =&gt; x + 1;
[Function]
&gt; 'hello'
'hello'
&gt; [1, 2, 3]
[ 1, 2, 3 ]
&gt; {a: 1, b: 2}
{ a: 1, b: 2 }
&gt; const x = 5;
undefined
&gt; x
5
&gt; y
Uncaught ReferenceError: y is not defined
&gt; const y = 10;
undefined
&gt; y
10
&gt; const sameAsX = x;
undefined
&gt; sameAsX
5
&gt; const alice = {name: 'Alice', age: 30};
undefined
&gt; alice
{ name: 'Alice', age: 30 }
&gt; const fruits = ['apple', 'banana', 'cherry'];
undefined
&gt; fruits
[ 'apple', 'banana', 'cherry' ]
&gt;
(To exit, press ^C again or ^D or type .exit)
&gt;

C:\Users\Tim&gt;
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
